---
type: HostObjectSubcomponentInfo
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 7
tags: [revit-api, class]
---

# HostObjectSubcomponentInfo

`Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCurveLoop | 2016 | `public CurveLoop GetCurveLoop ()` |
| Method | GetPlane | 2016 | `public Plane GetPlane ()` |
| Property | AreaOfCurveLoop | 2016 | `public double AreaOfCurveLoop { get ; }` |
| Property | Depth | 2016 | `public double Depth { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LoopFace | 2016 | `public Face LoopFace { get ; }` |